:PROPERTIES:
:ID:       EEB9EF4A-F97B-4D5E-BEDA-11D016382E00
:END:
#+title: JavaScript Object


* Objects

- In [[id:B178F57B-461C-4AF3-A52E-941A3D72571F][JavaScript]] an object is a stand alone entity - no need for classes
- A whole bunch of name value pairs
-       name : value pairs
- address: "100 St., Unit 301, 3rd Floor"

   address: {
                 street: "Main St.",
                 number: 100,
                 unit: {
                        number: 301,
                        floor: 3"
                        }
                 }
                 
* JS Complete #119

#+begin_src js :results output

  let bike = {
      make: "Yamaha",
      color: 'Blue',
      wheels: 2
      };

  console.log(bike);

#+end_src

#+RESULTS:
: { make: 'Yamaha', color: 'Blue', wheels: 2 }

* JS Complete #120

- Can only contain properties or methods

  #+begin_src js :results output

    let bike = {
        make: 'Yamaha',
        color: 'Blue',
        wheels: 2,
        sound: function() {
            console.log('Vrrrrmmmmm');
            }
        }
    console.log(bike);
    console.log(bike.sound());


  #+end_src

  #+RESULTS:
  : { make: 'Yamaha', color: 'Blue', wheels: 2, sound: [Function: sound] }
  : Vrrrrmmmmm
  : undefined
